Revit 2026 API

# MetallicPaintMetallicpaintBaseHighlightspread Property

---

The property labeled "Highlight Spread" from the "MetallicPaint" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string MetallicpaintBaseHighlightspread { get; }
```
```vb
Public Shared ReadOnly Property MetallicpaintBaseHighlightspread As String
	Get
```
```cpp
public:
static property String^ MetallicpaintBaseHighlightspread {
	String^ get ();
}
```
```fsharp
static member MetallicpaintBaseHighlightspread : string with get
```

#### Property Value

String

This property is of type "AssetPropertyDouble" within the range of "0, 1".

#### Reference

MetallicPaint Class

Autodesk.Revit.DB.Visual Namespace